---
type: StairsType
namespace: Autodesk.Revit.DB.Architecture
version: 2024
members: 19
tags: [revit-api, class]
---

# StairsType

`Autodesk.Revit.DB.Architecture.StairsType` · Revit 2024 · 19 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | ConstructionMethod | 2013 | `public StairsConstructionMethod ConstructionMethod { get ; }` |
| Property | EndConnectionType | 2013 | `public StairsEndConnectionType EndConnectionType { get ; set ; }` |
| Property | HasMiddleSupports | 2013 | `public bool HasMiddleSupports { get ; set ; }` |
| Property | LandingType | 2013 | `public ElementId LandingType { get ; set ; }` |
| Property | LeftLateralOffset | 2013 | `public double LeftLateralOffset { get ; set ; }` |
| Property | LeftSideSupportType | 2013 | `public ElementId LeftSideSupportType { get ; set ; }` |
| Property | MaxRiserHeight | 2013 | `public double MaxRiserHeight { get ; set ; }` |
| Property | MiddleSupportType | 2013 | `public ElementId MiddleSupportType { get ; set ; }` |
| Property | MiddleSupportsNumber | 2013 | `public int MiddleSupportsNumber { get ; set ; }` |
| Property | MinRunWidth | 2013 | `public double MinRunWidth { get ; set ; }` |
| Property | MinTreadDepth | 2013 | `public double MinTreadDepth { get ; set ; }` |
| Property | NotchExtension | 2013 | `public double NotchExtension { get ; set ; }` |
| Property | NotchHorizontalGap | 2013 | `public double NotchHorizontalGap { get ; set ; }` |
| Property | NotchThickness | 2013 | `public double NotchThickness { get ; set ; }` |
| Property | NotchVerticalGap | 2013 | `public double NotchVerticalGap { get ; set ; }` |
| Property | Parameter | — | `` |
| Property | RightLateralOffset | 2013 | `public double RightLateralOffset { get ; set ; }` |
| Property | RightSideSupportType | 2013 | `public ElementId RightSideSupportType { get ; set ; }` |
| Property | RunType | 2013 | `public ElementId RunType { get ; set ; }` |